app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."Director" = 'George Lucas'
---
  def same_director
    @movie = Movie.find(params[:id])
    director = @movie.director
    if director == nil or director.empty? then
      flash[:notice] = "'#{@movie.title}' has no director info"
      redirect_to movies_path
    else
      @movies = Movie.where(Director: director)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "movies" SET "title" = ?, "rating" = ?, "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Zootopia"], ["rating", "PG"], ["director", "Byron Howard"], ["updated_at", "2019-03-07 22:42:23.931783"], ["id", 1]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)